experiment-finetuned/all_finetuned/runs/wedge/3/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // Block 0 - bottom left
    (-0.15242 -0.005 -0.005)   // 0
    (-0.15242  0.1524 -0.005)  // 1
    (-0.15242  0.1524  0.005)  // 2
    (-0.15242 -0.005  0.005)   // 3

    // Block 1 - bottom right
    (0.3048 -0.005 -0.005)    // 4
    (0.3048  0.1524 -0.005)   // 5
    (0.3048  0.1524  0.005)   // 6
    (0.3048 -0.005  0.005)    // 7

    // Block 2 - top left
    (-0.15242  0.1524 -0.005)  // 8
    (-0.15242  0.1524  0.005)  // 9
    (-0.15242  0.1524  0.005)  // 10
    (-0.15242  0.1524 -0.005)  // 11

    // Block 3 - top right
    (0.3048  0.1524 -0.005)   // 12
    (0.3048  0.1524  0.005)   // 13
    (0.3048  0.1524  0.005)   // 14
    (0.3048  0.1524 -0.005)   // 15

    // Block 4 - bottom middle
    (-0.15242 -0.005 -0.005)   // 16
    (-0.15242  0.1524 -0.005)  // 17
    (0.3048  0.1524 -0.005)    // 18
    (0.3048 -0.005 -0.005)     // 19

    // Block 5 - top middle
    (-0.15242  0.1524 -0.005)  // 20
    (-0.15242  0.1524  0.005)  // 21
    (0.3048  0.1524  0.005)    // 22
    (0.3048  0.1524 -0.005)    // 23

    // Block 6 - front face
    (-0.15242 -0.005 -0.005)   // 24
    (-0.15242  0.1524 -0.005)  // 25
    (0.3048  0.1524 -0.005)    // 26
    (0.3048 -0.005 -0.005)     // 27

    // Block 7 - back face
    (-0.15242 -0.005  0.005)   // 28
    (-0.15242  0.1524  0.005)  // 29
    (0.3048  0.1524  0.005)    // 30
    (0.3048 -0.005  0.005)     // 31
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (10 10 1) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (10 10 1) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31) (10 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    wedge
    {
        type wall;
        faces
        (
            (8 9 10 11)
            (12 13 14 15)
            (20 21 22 23)
        );
    }
    top
    {
        type wall;
        faces
        (
            (16 17 18 19)
            (24 25 26 27)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (8 9 10 11)
            (12 13 14 15)
            (16 17 18 19)
            (20 21 22 23)
            (24 25 26 27)
            (28 29 30 31)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //